_posts/2016-07-24-linux-cluster.html
---
title: "HA Cluster"
date: 2016-07-24
layout: post
categories: 
- Linux
tags: 
- Linux 
- 运维 
- 网络
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline7">1. Cluster</a>
<ul>
<li><a href="#orgheadline1">系统扩展方式</a></li>
<li><a href="#orgheadline2">集群类型</a></li>
<li><a href="#orgheadline3">衡量系统的指标</a></li>
<li><a href="#orgheadline4">高效运维</a></li>
<li><a href="#orgheadline5">session保持</a></li>
<li><a href="#orgheadline6">术语</a></li>
</ul>
</li>
<li><a href="#orgheadline30">2. LB集群</a>
<ul>
<li><a href="#orgheadline8">lvs</a>
<ul>
<li><a href="#orgheadline9">lvs组件</a></li>
<li><a href="#orgheadline10">lvs类型</a></li>
<li><a href="#orgheadline11">lvs scheduler</a></li>
<li><a href="#orgheadline12">lvs架构</a></li>
<li><a href="#orgheadline17">ipvsadm的用法</a></li>
<li><a href="#orgheadline18">配置lvs-dr</a></li>
<li><a href="#orgheadline19">通过FWM定义集群</a></li>
<li><a href="#orgheadline20">lvs persistence</a></li>
<li><a href="#orgheadline21">实现调用RS的高可用</a></li>
</ul>
</li>
<li><a href="#orgheadline29">HAProxy</a>
<ul>
<li><a href="#orgheadline22">代理服务器相关</a></li>
<li><a href="#orgheadline23">负载均衡器算法</a></li>
<li><a href="#orgheadline24">配置</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
TODO
</p>




<hr  />
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">1</span> Cluster</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">系统扩展方式</h3>
<div class="outline-text-3" id="text-orgheadline1">
<ul class="org-ul">
<li>scale up: 向上扩展，使用性能更好的主机</li>
<li>scale out: 向外扩展，使用更多的主机</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">集群类型</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li>LB(Load Balancing)：负载均衡集群，任务分配
<ul class="org-ul">
<li>基于软硬件划分
<ul class="org-ul">
<li>硬件: F5、NetScaler、A10、Array、Redware</li>
<li>软件: LVS、HAProxy、Nginx、ats、perlbal</li>
</ul></li>
<li>基于工作的协议层次划分
<ul class="org-ul">
<li>传输层：lvs, haproxy(mode tcp)</li>
<li>应用层：haproxy, nginx, ats, perlbal</li>
</ul></li>
</ul></li>
<li>HA(High Availability)：高可用集群，系统快速修复
<ul class="org-ul">
<li>Availability=可用时间/总时间</li>
<li>vrrp: keepalived</li>
<li>AIS: heartbeat, OpenAIS, corosync/pacemaker, cman/rgmanager(conga)</li>
</ul></li>
<li>HP(High Performancing)：高性能集群，并行处理、分布式
<ul class="org-ul">
<li>分布式应用</li>
<li>分布式静态资源</li>
<li>分布式数据和存储</li>
<li>分布式计算</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">衡量系统的指标</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>可扩展性
<ul class="org-ul">
<li>构建高可扩展性系统的重要原则：在系统内部尽量避免串行化和交互</li>
</ul></li>
<li>可用性</li>
<li>容量: 请求处理的最大量</li>
<li>吞吐量: 单位时间的请求处理量</li>
<li>性能: 请求处理时间</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">高效运维</h3>
<div class="outline-text-3" id="text-orgheadline4">
<p>
可用 &#x2013;&gt; 标准化 &#x2013;&gt; 自动化
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">session保持</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>session绑定：基于cookie进行绑定</li>
<li>session集群：解决所有主机的session的同步问题</li>
<li>session服务器：解决session的可用性，可使用memcached、redis</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">术语</h3>
<div class="outline-text-3" id="text-orgheadline6">
<ul class="org-ul">
<li>调度器(负载均衡器)：director, dispatcher, balancer</li>
<li>RS: Real Server</li>
<li>Client IP: CIP</li>
<li>Director Virutal IP: VIP</li>
<li>Director IP: DIP</li>
<li>Real Server IP: RIP</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">2</span> LB集群</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">lvs</h3>
<div class="outline-text-3" id="text-orgheadline8">
<p>
lvs: Linux Virtual Server，根据请求报文的目标IP和PORT将其转发至后端主机集群中的某一台主机(根据挑选算法)，支持TCP, UDP, AH, ESP, AH_ESP, SCTP等诸多协议
</p>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">lvs组件</h4>
<div class="outline-text-4" id="text-orgheadline9">
<ul class="org-ul">
<li>ipvsadm: 用户空间的命令行工具，用于管理集群服务</li>
<li>ipvs: 工作内核中netfilter INPUT钩子上，报文传输线路为PREROUTING &#x2013;&gt; INPUT &#x2013;&gt; POSTROUTING</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">lvs类型</h4>
<div class="outline-text-4" id="text-orgheadline10">
<dl class="org-dl">
<dt>lvs-nat</dt><dd>多目标的DNAT，它通过修改请求报文的目标IP地址(同时可能会修改目标端口)至某RS的RIP地址实现转发
<ol class="org-ol">
<li>RIP和DIP应该使用私网地址，且RS的网关要指向DIP</li>
<li>请求和响应报文都要经由director转发，在极高负载的场景中，director可能会成为系统瓶颈</li>
<li>支持端口映射</li>
<li>RS可以使用任意OS</li>
</ol></dd>
<dt>lvs-dr</dt><dd>direct routing(默认)，它通过修改请求报文的目标MAC地址进行转发，仅请求报文经由director，响应报文是由RS直接响应给Client
<ol class="org-ol">
<li>Driector使用VIP、DIP；RS使用RIP、VIP</li>
<li>保证前端路由器将目标IP为VIP的请求报文发送给director，可以通过路由静态绑定、使用arptables使RS拒绝响应、直接修改RS主机内核的参数</li>
<li>RS的RIP可以使用私有地址；但也可以使用公网地址</li>
<li>RS跟Director必须在同一物理网络中</li>
<li>请求报文经由Director调度，但响应报文一定不能经由Director</li>
<li>不支持端口映射</li>
<li>RS可以大多数OS</li>
<li>RS通过地址为VIP的lo设备进行操作</li>
<li>RS的网关不能指向DIP，应指向外网路由</li>
</ol></dd>
<dt>lvs-tun</dt><dd>不修改请求报文的IP首部，而是通过在原有的IP首部(CIP,VIP)之外，再封装一个IP首部(DIP,RIP)
<ol class="org-ol">
<li>RIP、DIP、VIP都是公网地址</li>
<li>RS通过地址为VIP的lo设备接受和发送报文</li>
<li>请求报文必须经由director调度，但响应报文必须不能经由director</li>
<li>不支持端口映射</li>
<li>RS的OS必须支持隧道功能</li>
<li>必要时需要限制请求报文的MTU大小</li>
</ol></dd>
<dt>lvs-fullnat</dt><dd>director通过同时修改请求报文的目标地址和源地址进行转发，需要使用淘宝开源项目进行支持
<ol class="org-ol">
<li>VIP是公网地址；RIP和DIP是私网地址，二者无须在同一网络中</li>
<li>RS接收到的请求报文的源地址为DIP</li>
<li>请求报文和响应报文都必须经由Director</li>
<li>支持端口映射机制</li>
<li>RS可以使用任意OS</li>
</ol></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">lvs scheduler</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
scheduler是Director通过算法来选择要调度的RS
</p>
<ul class="org-ul">
<li>静态方法: 仅根据算法本身进行调度
<ul class="org-ul">
<li>RR(round robin): 轮调</li>
<li>WRR(weighted rr): 按照权重分配</li>
<li>SH(source hash): 将来自于同一个IP的请求始终调度至同一RS，实现session保持的机制，但只适用于同个端口</li>
<li>DH(destination hash): 将对同一个目标的请求始终发往同一个RS，对于新目标使用轮调分配，用于正向代理情形下的缓存服务器调度</li>
</ul></li>
<li>动态方法: 根据算法计算各RS的当前负载状态(Overhead)进行调度，其中Active是活动连接数，Inactive是非活动连接数
<ul class="org-ul">
<li>LC(Least Connection): Overhead=Active*256+Inactive</li>
<li>WLC(Weighted LC): Overhead=(Active*256+Inactive)/weight</li>
<li>SED(Shortest Expection Delay): Overhead=(Active+1)*256/weight，解决WLC下0连接数时的分配</li>
<li>NQ(Never Queue): SED算法的改进，优先分配给0连接数的RS</li>
<li>LBLC(Locality-Based LC): 动态的DH算法，对于新目标使用LC分配，用于正向代理情形下的缓存服务器调度</li>
<li>LBLCR(Locality-Based Least-Connection with Replication): 带复制功能的LBLC算法</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">lvs架构</h4>
<div class="outline-text-4" id="text-orgheadline12">
<ol class="org-ol">
<li>一个ipvs主机可以同时定义多个cluster service</li>
<li>一个cluster service上至少应该一个real server</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">ipvsadm的用法</h4>
<div class="outline-text-4" id="text-orgheadline17">
</div><ul class="org-ul"><li><a id="orgheadline13"></a>管理集群服务<br  /><div class="outline-text-5" id="text-orgheadline13">
<div class="org-src-container">

<pre class="src src-conf">ipvsadm -A|-E service [-s scheduler] [-p SECOND] <span style="color: #75715E;"># </span><span style="color: #75715E;">APPEND</span>
ipvsadm -D service  <span style="color: #75715E;"># </span><span style="color: #75715E;">DELETE</span>
  service:
    tcp: -t ip:port (port&#20026;0&#26102;&#20195;&#34920;&#25152;&#26377;&#31471;&#21475;)
    udp: -u ip:port
    fwm: -f mark&#65292;&#26816;&#27979;&#22312;PREROUTING&#19978;&#30340;&#26631;&#35760;&#65292;&#29992;&#20110;&#21512;&#24182;&#22810;&#20010;&#26381;&#21153;(&#31471;&#21475;)

  -s scheduler: &#40664;&#35748;&#20026;WLC
  -p SCEOND: lvs persistence&#65292;&#35774;&#32622;&#25345;&#32493;&#36830;&#25509;&#26102;&#38388;
</pre>
</div>
</div></li>
<li><a id="orgheadline14"></a>管理集群服务中的RS<br  /><div class="outline-text-5" id="text-orgheadline14">
<div class="org-src-container">

<pre class="src src-conf">ipvsadm -a service -r server-address lvs-type [-w weight]
ipvsadm -d service -r server-address
  server-address: RS&#30340;&#22320;&#22336;&#65292;ip[:port]

  lvs-type:
    -g: GATEWAY, lvs-dr(&#40664;&#35748;)
    -i: IPIP, lvs-tun
    -m: MASQUERADE, lvs-nat

  -w weight: &#35774;&#32622;RS&#30340;&#26435;&#37325;&#65292;&#24403;&#26435;&#37325;&#20026;0&#26102;&#19981;&#20250;&#35843;&#29992;&#35813;RS
</pre>
</div>
</div></li>
<li><a id="orgheadline15"></a>清空和查询<br  /><div class="outline-text-5" id="text-orgheadline15">
<div class="org-src-container">

<pre class="src src-conf">ipvsadm -C  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#28165;&#31354;&#25152;&#26377;&#35268;&#21017;</span>
ipvsadm -L|l [options]  
    -n: numeric&#65292;&#22522;&#20110;&#25968;&#23383;&#26684;&#24335;&#26174;&#31034;&#22320;&#22336;&#21644;&#31471;&#21475;
    -c: connection&#65292;&#26174;&#31034;ipvs&#36830;&#25509;
    --stats: &#32479;&#35745;&#25968;&#25454;
    --rate: &#36895;&#29575;
    --exact: &#31934;&#30830;&#20540;
</pre>
</div>
</div></li>
