blog/2016-07-24-linux-cluster.org
*** 配置lvs-dr
- 内核参数
  - arp_ignore: 是否响应别人的ARP广播请求
    - 0: 检查自己的所有接口的地址
    - 1: 检查同一接口上的地址
  - arp_announce: 是否进行ARP通告
    - 0: 通告自己所有接口的地址
    - 1: 尽量避免通告不在同一接口的地址
    - 2: 不通告不在同一接口的地址
- director配置
  #+BEGIN_SRC sh
  # ifconfig eno16777736:0 172.16.100.10/32 broadcast 172.16.100.10 up
  ip addr add 172.16.100.10/32 dev eno16777736
  # route add -host 172.16.100.10 dev eno16777736:0
  ip route add 172.16.100.10 dev eno16777736
  
  ipvsadm -A -t 172.16.100.10:80
  ipvsadm -a -t 172.16.100.10:80 -r 172.16.100.21 -g
  #+END_SRC
- RS配置
  #+BEGIN_SRC sh
  echo 1 > /proc/sys/net/ipv4/conf/all/arp_ignore 
  echo 2 > /proc/sys/net/ipv4/conf/all/arp_announce 

  ifconfig lo:0 172.16.100.10/32 broadcast 172.16.100.10 up
  route add -host 172.16.100.10 dev lo:0
  #+END_SRC
*** 通过FWM定义集群
1. 在director上netfilter的mangle表的PREROUTING定义MARK
   #+BEGIN_SRC conf
   iptables -t mangle -A PREROUTING -d $vip -p $protocol --dports $port -j MARK --set-mark mark_num
   #+END_SRC
2. 基于FWM定义集群服务
   #+BEGIN_SRC conf
   ipvsadm -A -f mark_num -s scheduler
   #+END_SRC
*** lvs persistence
lvs持久连接: 无论ipvs使用何种调度方法，其都能实现将来自于同一个Client的请求始终定向至第一次调度时挑选出的RS，通过维护一个持久连接表来实现(SIP RS timer)
- 持久连接的实现方式
  - 每端口持久：PPC，单服务持久调度
  - 每FWM持久：PFWMC，单FWM持久调度
  - 每客户端持久：PCC，所有端口持久调度，定义集群服务时把端口定义为0
*** 实现调用RS的高可用
director对RS做健康状态检测，并且根据检测的结果自动完成添加或移除等管理功能
1. 基于协议层次检查: 层次越低，效率越高，精确度越低
   - ip: icmp
   - 传输层：检测端口的开放状态
   - 应用层：请求获取关键性的资源
2. 检查频度
3. 状态判断: 需要多次检测服务器来确定服务器是否失效
4. 配置一个网页故障时所显示的页面的服务器
** HAProxy
*** 代理服务器相关
- 代理(http)
  - 正向代理: 客户端代理
  - 反向代理: 服务器代理
  - 可以在报文上添加Via首部表示代理的服务器
- 代理的作用
  - web缓存(加速)
  - 反向代理
  - 内容路由(根据流量及内容类型等将请求转发至特定服务器)
  - 转码器
- 缓存的作用
  - 减少冗余内容传输
  - 节省带宽、缓解网络瓶颈
  - 降低了对原始服务器的请求压力
  - 降低了传输延迟
- HAProxy的功能
  - http协议反向代理
  - tcp层的LB
*** 负载均衡器算法
- 取模法: 无法适应后端服务器个数的改变
- 一致性hash算法: 使用环形hash来计算，但可能会出现偏斜
  - 虚拟服务器: 后端服务器在环上虚拟多个点，使命中平衡
- ebtree: 弹性二叉树
*** 配置
- 配置文件: /etc/haproxy/haproxy.cfg
**** 全局配置
#+BEGIN_SRC conf
global  # 全局配置
    log 127.0.0.1 local2  # 配置日志服务器，可配置两个
    log-send-hostname [string] # 在日志中记录该服务器的主机名

    chroot /var/lib/haproxy  # 运行的目录，提高安全性
    pidfile /var/run/haproxy.pid
    user haproxy
    group haproxy

    daemon  # 若不加则运行在前端
    nbproc 1  # 启动的进程数，默认为1个，多个一般用于调试
    maxconn 4000  # 每个进程的最大连接数

    spread-checks [0-50] # 分散健康状态检查的发送时间
#+END_SRC
**** 代理配置
#+BEGIN_SRC conf
defaults  # 用于为所有其它配置段提供默认参数

frontend main  # 定义监听的套接字
    bind *:80
    use_backend
    default_backend websrvs

defaults  # 重新设定默认参数

backend websrvs  # 定义后端服务器
    balance roundrobin
    server web1 172.16.100.68 check
    server web2 172.16.100.69 check

listen  # 同时定义前端与后端
    ...
#+END_SRC
