_posts/2016-07-24-linux-cluster.html
<li><a id="orgheadline16"></a>保存和重载<br  /><div class="outline-text-5" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-conf">ipvsadm -R &lt; FILE
ipvsadm -S [-n] &gt; FILE
</pre>
</div>
</div></li></ul>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">配置lvs-dr</h4>
<div class="outline-text-4" id="text-orgheadline18">
<ul class="org-ul">
<li>内核参数
<ul class="org-ul">
<li>arp_ignore: 是否响应别人的ARP广播请求
<ul class="org-ul">
<li>0: 检查自己的所有接口的地址</li>
<li>1: 检查同一接口上的地址</li>
</ul></li>
<li>arp_announce: 是否进行ARP通告
<ul class="org-ul">
<li>0: 通告自己所有接口的地址</li>
<li>1: 尽量避免通告不在同一接口的地址</li>
<li>2: 不通告不在同一接口的地址</li>
</ul></li>
</ul></li>
<li><p>
director配置
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #75715E;"># </span><span style="color: #75715E;">ifconfig eno16777736:0 172.16.100.10/32 broadcast 172.16.100.10 up</span>
ip addr add <span style="color: #AE81FF;">172.16.100.10/32</span> dev eno16777736
<span style="color: #75715E;"># </span><span style="color: #75715E;">route add -host 172.16.100.10 dev eno16777736:0</span>
ip route add <span style="color: #AE81FF;">172.16.100.10</span> dev eno16777736

ipvsadm -A -t <span style="color: #AE81FF;">172.16.100.10:80</span>
ipvsadm -a -t <span style="color: #AE81FF;">172.16.100.10:80</span> -r <span style="color: #AE81FF;">172.16.100.21</span> -g
</pre>
</div></li>
<li><p>
RS配置
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #F92672;">echo</span> <span style="color: #AE81FF;">1</span> &gt; /proc/sys/net/ipv4/conf/all/arp_ignore 
<span style="color: #F92672;">echo</span> <span style="color: #AE81FF;">2</span> &gt; /proc/sys/net/ipv4/conf/all/arp_announce 

ifconfig lo:0 <span style="color: #AE81FF;">172.16.100.10/32</span> broadcast <span style="color: #AE81FF;">172.16.100.10</span> up
route add -host <span style="color: #AE81FF;">172.16.100.10</span> dev lo:0
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19">通过FWM定义集群</h4>
<div class="outline-text-4" id="text-orgheadline19">
<ol class="org-ol">
<li><p>
在director上netfilter的mangle表的PREROUTING定义MARK
</p>
<div class="org-src-container">

<pre class="src src-conf">iptables -t mangle -A PREROUTING -d $vip -p $protocol --dports $port -j MARK --set-mark mark_num
</pre>
</div></li>
<li><p>
基于FWM定义集群服务
</p>
<div class="org-src-container">

<pre class="src src-conf">ipvsadm -A -f mark_num -s scheduler
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20">lvs persistence</h4>
<div class="outline-text-4" id="text-orgheadline20">
<p>
lvs持久连接: 无论ipvs使用何种调度方法，其都能实现将来自于同一个Client的请求始终定向至第一次调度时挑选出的RS，通过维护一个持久连接表来实现(SIP RS timer)
</p>
<ul class="org-ul">
<li>持久连接的实现方式
<ul class="org-ul">
<li>每端口持久：PPC，单服务持久调度</li>
<li>每FWM持久：PFWMC，单FWM持久调度</li>
<li>每客户端持久：PCC，所有端口持久调度，定义集群服务时把端口定义为0</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21">实现调用RS的高可用</h4>
<div class="outline-text-4" id="text-orgheadline21">
<p>
director对RS做健康状态检测，并且根据检测的结果自动完成添加或移除等管理功能
</p>
<ol class="org-ol">
<li>基于协议层次检查: 层次越低，效率越高，精确度越低
<ul class="org-ul">
<li>ip: icmp</li>
<li>传输层：检测端口的开放状态</li>
<li>应用层：请求获取关键性的资源</li>
</ul></li>
<li>检查频度</li>
<li>状态判断: 需要多次检测服务器来确定服务器是否失效</li>
<li>配置一个网页故障时所显示的页面的服务器</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">HAProxy</h3>
<div class="outline-text-3" id="text-orgheadline29">
</div><div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22">代理服务器相关</h4>
<div class="outline-text-4" id="text-orgheadline22">
<ul class="org-ul">
<li>代理(http)
<ul class="org-ul">
<li>正向代理: 客户端代理</li>
<li>反向代理: 服务器代理</li>
<li>可以在报文上添加Via首部表示代理的服务器</li>
</ul></li>
<li>代理的作用
<ul class="org-ul">
<li>web缓存(加速)</li>
<li>反向代理</li>
<li>内容路由(根据流量及内容类型等将请求转发至特定服务器)</li>
<li>转码器</li>
</ul></li>
<li>缓存的作用
<ul class="org-ul">
<li>减少冗余内容传输</li>
<li>节省带宽、缓解网络瓶颈</li>
<li>降低了对原始服务器的请求压力</li>
<li>降低了传输延迟</li>
</ul></li>
<li>HAProxy的功能
<ul class="org-ul">
<li>http协议反向代理</li>
<li>tcp层的LB</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23">负载均衡器算法</h4>
<div class="outline-text-4" id="text-orgheadline23">
<ul class="org-ul">
<li>取模法: 无法适应后端服务器个数的改变</li>
<li>一致性hash算法: 使用环形hash来计算，但可能会出现偏斜
<ul class="org-ul">
<li>虚拟服务器: 后端服务器在环上虚拟多个点，使命中平衡</li>
</ul></li>
<li>ebtree: 弹性二叉树</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">配置</h4>
<div class="outline-text-4" id="text-orgheadline24">
<ul class="org-ul">
<li>配置文件: /etc/haproxy/haproxy.cfg</li>
</ul>
</div>
<ul class="org-ul"><li><a id="orgheadline25"></a>全局配置<br  /><div class="outline-text-5" id="text-orgheadline25">
<div class="org-src-container">

<pre class="src src-conf">global  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20840;&#23616;&#37197;&#32622;</span>
    log 127.0.0.1 local2  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#37197;&#32622;&#26085;&#24535;&#26381;&#21153;&#22120;&#65292;&#21487;&#37197;&#32622;&#20004;&#20010;</span>
    log-send-hostname [string] <span style="color: #75715E;"># </span><span style="color: #75715E;">&#22312;&#26085;&#24535;&#20013;&#35760;&#24405;&#35813;&#26381;&#21153;&#22120;&#30340;&#20027;&#26426;&#21517;</span>

    chroot /var/lib/haproxy  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36816;&#34892;&#30340;&#30446;&#24405;&#65292;&#25552;&#39640;&#23433;&#20840;&#24615;</span>
    pidfile /var/run/haproxy.pid
    user haproxy
    group haproxy

    daemon  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#33509;&#19981;&#21152;&#21017;&#36816;&#34892;&#22312;&#21069;&#31471;</span>
    nbproc 1  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#30340;&#36827;&#31243;&#25968;&#65292;&#40664;&#35748;&#20026;1&#20010;&#65292;&#22810;&#20010;&#19968;&#33324;&#29992;&#20110;&#35843;&#35797;</span>
    maxconn 4000  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#27599;&#20010;&#36827;&#31243;&#30340;&#26368;&#22823;&#36830;&#25509;&#25968;</span>

    spread-checks [0-50] <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20998;&#25955;&#20581;&#24247;&#29366;&#24577;&#26816;&#26597;&#30340;&#21457;&#36865;&#26102;&#38388;</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline26"></a>代理配置<br  /><div class="outline-text-5" id="text-orgheadline26">
<div class="org-src-container">

<pre class="src src-conf">defaults  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#29992;&#20110;&#20026;&#25152;&#26377;&#20854;&#23427;&#37197;&#32622;&#27573;&#25552;&#20379;&#40664;&#35748;&#21442;&#25968;</span>

frontend main  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;&#30417;&#21548;&#30340;&#22871;&#25509;&#23383;</span>
    bind *:80
    use_backend
    default_backend websrvs

defaults  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#37325;&#26032;&#35774;&#23450;&#40664;&#35748;&#21442;&#25968;</span>

backend websrvs  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23450;&#20041;&#21518;&#31471;&#26381;&#21153;&#22120;</span>
    balance roundrobin
    server web1 172.16.100.68 check
    server web2 172.16.100.69 check

listen  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21516;&#26102;&#23450;&#20041;&#21069;&#31471;&#19982;&#21518;&#31471;</span>
    ...
</pre>
</div>
</div></li>
